Revit 2027 API
RebarSpliceRules Methods
The RebarSpliceRules type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of RebarSpliceRules with the default options.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetMaximumAndMinimumBarLength |  Sets the maximum and minimum bar length.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RebarSpliceRules Class
Autodesk.Revit.DB.Structure Namespace